/* VERSION: Finnish Translation file - Version 3.1.2 - 2011 Aug 8 */

/* Publication Type and Seperator in the Publication Picker */
"   BIBLE DVD" = "   RAAMATTU DVD";

/* Publication Type and Seperator in the Publication Picker */
"   BOOKS" = "   KIRJAT";

/* Publication Type and Seperator in the Publication Picker */
"   BROCHURES" = "   KIRJASET";

/* Publication Type and Seperator in the Publication Picker */
"   CAMPAIGN TRACTS" = "   KAMPANJATRAKTAATIT";

/* Publication Type and Seperator in the Publication Picker */
"   DVD" = "   DVD";

/* Publication Type and Seperator in the Publication Picker */
"   TRACTS" = "   TRAKTAATIT";

/* Apartment Number and street name represented by %1$@ as the apartment number and %2$@ as the street name */
"#%@ %@" = "%2$@ #%1$@";

/* House number and apartment number represented by %1$@ as the house number and %2$@ as the apartment number */
"%@ #%@" = "%1$@ #%2$@";

/* House number, apartment number and Street represented by %1$@ as the house number, %2$@ as the apartment number, notice the # before it that will be there as 'number ...' and then %3$@ as the street name */
"%@ #%@ %@ " = "%3$@ %1$@ #%2$@ ";

/* House number and Street represented by %1$@ as the house number and %2$@ as the street name */
"%@ %@" = "%2$@ %1$@";

/* This is a representation for the watchtower or awake (or W & A combo) when it was published on the 1, 15 and 2, 22 respectively, like Watchtower March 15, 2001, please use %1$@ as the magazine type %2$@ as the month and %3$d as the year */
"%@ %@ %d" = "%1$@ %2$@ %3$d";

/* This is a representation for the watchtower or awake when it was published on the 1, 15 and 2, 22 respectively, like Watchtower March 15, 2001, please use %1$@ as the magazine type %2$@ as the month %3$d as the day of the month and %4$d as the year */
"%@ %@ %d, %d" = "%1$@ %2$@ %3$d, %4$d";

/* Text used in the email that is sent to the congregation secretary, the <br> you see in the text are RETURN KEYS so that you can space multiple months apart from eachother */
"%@ Field Service Activity Report:<br>" = "%@ Kenttäpalvelusraportti:<br>";

/* City and state(or country) as represented in an address (usually right under the house number and street) */
"%@, %@" = "%1$@, %2$@";

/* This is a representation for the yearbook when it was published on what year, like 2009 Yearbook, please use %2$@ as the placeholder for 'Yearbook' %1$d as the year */
"%d %@" = "%1$d %2$@";

/* You are localizing the time (I dont know if you need to even change this) as in '1 hour 34 minutes' or '2 hours 1 minute' %1$d is the hours number %2$@ is the label for hour(s) %3$d is the minutes number and 4$%@ is the label for minutes(s) */
"%d %@ %d %@" = "%1$d %2$@ %3$d %4$@";

/* '1 Brochure: The Trinity' with the format '%d %@: %@', the %@ represents the Magazine, Book, or Brochure type and the %d represents the count of publications */
"%d %@: %@" = "%1$d %2$@: %3$@";

/* Number of months shown in the statistics view, setting title */
"%d Month Displayed" = "Näytä %d kuukausi";

/* Number of months shown in the statistics view, setting title */
"%d Months Displayed" = "Näytä %d kuukautta";

/* 1, singular publication, shown as '%d publication' */
"%d publication" = "%d julkaisu";

/* more than one publications, shown as '%d publications' */
"%d publications" = "%d julkaisua";

/* Short form of Bulk Magazine Placements for the Watchtower and Awake '%d: %@' */
"%d: %@" = "%1$d: %2$@";

/* This is the label that is at the bottom of the sorted calls view showing you how many calls you have (if there is a single call... this is the single version of the text) */
"%u Call" = "%u käynti";

/* This is the label that is at the bottom of the sorted calls view showing you how many calls you have  (if there is a more than one call... this is the plural version of the text) */
"%u Calls" = "%u käyntiä";

/* name you see if you have a study who is not named yet and you go to Statistics->Study Individuals-> */
"(Study not named?)" = "(Nimeämätön tutkistelu?)";

/* (unknown street) Placeholder Section title in the Sorted By Calls view */
"(unknown street)" = "(tuntematon katu)";

/* label for sending a printable email backup.  this label is in the body of the email */
"<h1>Backup data for %@:</h1>\n" = "<h1>Varmuuskopioi tiedot %@:</h1>\n";

/* label for sending a printable email backup.  this label is in the body of the email */
"<h2>Bulk Placements:</h2>\n" = "<h2>Katutyö:</h2>\n";

/* label for sending a printable email backup.  this label is in the body of the email */
"<h2>Calls:</h2>\n" = "<h2>Käynnit:</h2>\n";

/* label for sending a printable email backup.  this label is in the body of the email */
"<h2>Hours:</h2>\n" = "<h2>Tunnit:</h2>\n";

/* label for sending a printable email backup.  this label is in the body of the email */
"<h2>RBC Hours:</h2>\n" = "<h2>Hyvitystunnit:</h2>\n";

/* Sorted by ... view section index for unknown values which coresponds to the 'Unknown' section header */
"?" = "?";

/* Tracts Publication Name (T-17) */
"A Peaceful New World-Will It Come?" = "Rauhaisa uusi maailma – onko sellainen tulossa?";

/* title for the marker when you have to manually set the location for a call */
"Acquiring Location..." = "Haetaan sijaintia...";

/* Add a placed publication action button in call view */
"Add a placed publication" = "Lisää levitetty julkaisu";

/* Add a return visit action button */
"Add a return visit" = "Lisää uusintakäynti";

/* Button to click to add more information like phone number and email address */
"Add Additional Information" = "Lisää muita tietoja";

/* Button to click to add an additional user to MyTime */
"Add Additional User" = "Lisää uusi käyttäjä";

/* button to add streets to the list of not at home streets
   Title for the a new house in the Not At Home view */
"Add Attempt" = "Lisää käyntiyritys";

/* Button to click to add an 'Additional Information' to calls */
"Add Custom Information" = "Lisää uusi tietotyyppi";

/* Button to click to add an additional sort or filter rule for the Sorted By ... view */
"Add Filter Rule" = "Lisää suodatus";

/* button to add streets to the list of not at home streets
   Title for the a new house in the Not At Home view */
"Add House" = "Lisää talo";

/* Add Information title */
"Add Info" = "Lisää tietoja";

/* button to press when you are in the Multiple Choice view, this button lets the user add another choice to a multiple choice type */
"Add New Choice" = "Lisää uusi valinta";

/* Button to click to add an additional sort or filter rule for the Sorted By ... view */
"Add New Display Rule" = "Lisää uusi näkymä";

/* button to press when you are in the Quick Notes view and have pressed the Edit nagivation button, this button lets the user add another quick note favorite */
"Add New Quick Note" = "Lisää uusi muistiinpano";

/* Button to click to add an additional sort or filter rule for the Sorted By ... view */
"Add New Sort Rule" = "Lisää uusi lajittelu";

/* Title for the a new territory in the Territories view */
"Add New Territory" = "Lisää uusi alue";

/* Placeholder for adding notes in the Not At Home views
   Return Visit Notes Placeholder text */
"Add Notes" = "Lisää muistiinpanoja";

/* Action Button in the Day's Bulk Literature Placement View called 'Add placed publications' */
"Add placed publications" = "Lisää levitetty kirjallisuus";

/* button to add streets to the list of not at home streets
   Title for the a new street in the Territories view */
"Add Street" = "Lisää katu";

/* This text is right below the Quick notes Favoriate section describing what this section is for */
"Add your current presentations or common notes here to be used as a template for notes for your initial/return visits" = "Lisää tähän ajankohtainen esityksesi tai muistiinpanomalleja, joita voit käyttää merkitessäsi käyntejä/uusintakäyntejä";

/* category in the Display Rules when picking sorting rules
   Title for email section for the \"Additional Information\" info */
"Additional Information" = "Muita tietoja";

/* Address label for call
   category in the Display Rules when picking sorting rules */
"Address" = "Osoite";

/* label name for the cell asking if you want to match all or just match one
   search button in the sorted calls view to search through all of the call information */
"All" = "Kaikki";

/* cancel button */
"All Calls" = "Kaikki käynnit";

/* all publicaitons label for publication type */
"All Publications" = "Kaikki julkaisut";

/* Book Publication Name (si) */
"All Scripture is Inspired" = "Koko Raamattu on Jumalan henkeyttämä ja hyödyllinen";

/* Tracts Publication Name (T-27) */
"All Suffering Soon to End" = "Kärsimykset loppuvat pian!";

/* Footer in the 'Additional Information' for the entries that will always show in every call */
"Any rows below that you move up here will always show up in your calls" = "Kaikki alla olevat rivit ovat aina käytettävissä merkitessäsi käyntejä";

/* Short month name */
"Apr" = "Huh";

/* Long month name */
"April" = "Huhtikuu";

/* Apartment/Floor Number
   Title for the Display Rules 'pick a sort rule' screen */
"Apt/Floor" = "Asunto/kerros";

/* Multiple Users: question asked when the user wants to delete a user's data */
"Are you sure that you want to DELETE ALL USER DATA for %@?\n\nYou can not recover from this action, you will DELETE all of your calls, hours, and other statistics for this user. Are you really sure you want to do this?" = "Haluatko varmasti POISTAA KAIKKI KÄYTTÄJÄN %@ TIEDOT?\n\nTätä toimintoa ei voi peruuttaa, vaan kaikki käyttäjän käynnit, tunnit ja muut merkinnät POISTETAAN. Haluatko varmasti jatkaa?";

/* Statement to make the user realize that they are deleting a call forever */
"Are you sure you want to delete the call forever, and remove all return visits, studies, and placed publications in your statistics?" = "Oletko varma, että haluat poistaa käynnin lopullisesti sekä kaikki siihen liittyvät uusintakäynnit, tutkistelut ja levityetyt julkaisut tilastoistasi?";

/* Statement to make the user realize that this will still save information, and acknowledge they are deleting a call */
"Are you sure you want to delete the call?\n\nThe return visits and placed literature will still be counted in your statistics and you can restore or permanently delete this call in the \"Deleted Calls\" View." = "Oletko varma, että haluat poistaa käynnin?\n\nUusintakäynnit ja levitetyt julkaisut lasketaan edelleen mukaan tilastoihisi ja voit palauttaa tai poistaa lopullisesti tämän käynnin \"Poistetut käynnit\" näkymässä.";

/* Statement to make the user realize that this will still save information, and acknowledge they are deleting a call */
"Are you sure you want to restore the call (your statistics will not change)?" = "Haluatko varmasti palauttaa käynnin (tilastoihisi ei tehdä muutoksia)?";

/* Title of the section in the Not-At-Homes house view that allows you to add/edit attempts for the house
   used as a label when emailing not at homes */
"Attempts" = "Käyntiyritykset";

/* Short month name */
"Aug" = "Elo";

/* Long month name */
"August" = "Elokuu";

/* Autobackup label when enabled in the statistics view, setting title */
"Autobackup after %u days" = "Automaattinen varmistus %u päivän välein";

/* Autobackup label when enabled in the statistics view, setting title */
"Autobackup every day" = "Automaattinen varmistus joka päivä";

/* Title for selecting the number of days till you autobackup from the statistics view */
"Autobackup Interval" = "Automaattisen varmistuksen jaksotus";

/* This is a button you see when you create a new call and go to the address view for the first time, it allows the user to use google to lookup the address by the current location */
"Automatically Lookup Address" = "Hae osoite automaattisesti";

/* publisher type selected in the More->Settings->Publisher Type setting */
"Auxilliary Pioneer" = "Osa-aikainen tienraivaaja";

/* Magizine Publication Name (g) */
"Awake" = "Herätkää";

/* Book Publication Name (gvol) */
"Awake Bound Volume" = "Herätkään sidottu vuosikerta";

/* More View Table Group Title */
"Backup" = "Varmistus";

/* More->Settings view backup email address */
"Backup Address" = "Varmistusosoite";

/* More->Settings view backup attachment */
"Backup Attachment" = "Varmistuksen liite";

/* This message is displayed after a successful import of a call or a restore of a backup */
"Backup restored, press OK to quit mytime. You will have to restart to use your restored data" = "Varmistus palautettu. Paina OK lopettaaksesi mytime:n. Ohjelma pitää käynnistää uudelleen palautuksen jälkeen";

/* More View Table backup your data */
"Backup using 'MyTime Backup'" = "Varmista 'MyTime Backup':lla";

/* message displayed when someone wants to email me, I just want to make sure that they have read the website before asking a question */
"Because I might have received > 200 emails about a question, please read the Frequently Asked Questions section of the MyTime website before emailing me to ask a question.  Also, please read the existing feature request list before requesting a feature." = "Koska olen saattanut vastaanottaa yli 200 sähköpostia kysymykseesi liittyen, ole hyvä ja lue huolellisesti Frequently Asked Questions osio MyTime web-sivustolta ennen uuden kysymyksen lähettämistä.  Katso myös pyydettyjen ominaisuuksien listaa ennen kuin lähetät oman pyyntöri.";

/* Title for switch in the filter for the strings operator */
"Begins With" = "Alkaa";

/* Book Publication Name */
"Bible" = "Raamattu";

/* Publication Type name */
"Bible DVD" = "Raamattu DVD";

/* Bible DVD Publication Name */
"Bible DVD: 1&2 Corinthians" = "Raamattu DVD: 1. ja 2. Korinttilaisille";

/* Bible DVD Publication Name */
"Bible DVD: 1&2 Thessalonians, 1&2 Timothy, Titus, Philemon" = "Raamattu DVD: 1. ja 2. Tessalonikalaisille, 1. ja 2. Timoteukselle, Titukselle, Filemonille";

/* Bible DVD Publication Name */
"Bible DVD: Acts" = "Raamattu DVD: Apostolien teot";

/* Bible DVD Publication Name */
"Bible DVD: Galatians, Ephesians, Philippians, Colossians" = "Raamattu DVD: Galatalaisille, Efesolaisille, Filippiläisille, Kolossalaisille";

/* Bible DVD Publication Name */
"Bible DVD: Hebrews, James, 1&2 Peter" = "Raamattu DVD: Heprealaisille, Jaakobin kirje, 1. ja 2. Pietarin kirje";

/* Bible DVD Publication Name (1543) */
"Bible DVD: John" = "Raamattu DVD: Johannes";

/* Bible DVD Publication Name (1542) */
"Bible DVD: Luke" = "Raamattu DVD: Luukas";

/* Bible DVD Publication Name (1541) */
"Bible DVD: Mark" = "Raamattu DVD: Markus";

/* Bible DVD Publication Name (1540) */
"Bible DVD: Matthew" = "Raamattu DVD: Matteus";

/* Bible DVD Publication Name */
"Bible DVD: Romans" = "Raamattu DVD: Roomalaisille";

/* Plural Publication Type name */
"Bible DVDs" = "Raamattu DVD:t";

/* Bible Studies label on the Statistics View */
"Bible Studies" = "Raamatuntutkistelut";

/* Brochures Publication Name (hb) */
"Blood" = "Veri";

/* Publication Type name */
"Book" = "Kirja";

/* Brochures Publication Name (ba) */
"Book for All" = "Kirja kaikille ihmisille";

/* Plural Publication Type name
   Publication Type name */
"Books" = "Kirjat";

/* Publication Type name */
"Brochure" = "Kirjanen";

/* Plural Publication Type name
   Publication Type name */
"Brochures" = "Kirjaset";

/* More View Table Build Date */
"Build Date" = "Julkaisupäivä";

/* Title for Bulk Placements view */
"Bulk Placements" = "Katutyö";

/* Call main title when editing an existing call
   category in the Display Rules when picking sorting rules */
"Call" = "Käynti";

/* Address title for address form */
"Call Address" = "Käynnin osoite";

/* View title */
"Calls Sorted by City" = "Käynnit kaupungeittain";

/* view title */
"Calls Sorted by Date" = "Käynnit päivämäärän mukaan";

/* View title */
"Calls Sorted by Name" = "Käynnit nimen mukaan";

/* view title */
"Calls Sorted by Street" = "Käynnit kaduittain";

/* Publication Type name */
"Campaign Tract" = "Kampanjatraktaatti";

/* Plural Publication Type name
   Publication Type name */
"Campaign Tracts" = "Kampanjatraktaatit";

/* Cancel button
   Cancel Button */
"Cancel" = "Peruuta";

/* Title for switch in the filter view to have the strings be compared in a case sensitive manor */
"Case Insensitive" = "Merkkikokoriippuvainen";

/* Change Date action button for visit in call view */
"Change Date" = "Muuta päivämäärää";

/* The title used in the Settings->Multiple Users screen */
"Choice Name" = "Valinnan nimi";

/* City
   Title for the Display Rules 'pick a sort rule' screen
   used as a label when emailing not at homes */
"City" = "Kaupunki";

/* button bar title */
"City Sorted" = "Kaupungeittain";

/* This is the text that appears in the link of the email when you are transferring a call to another witness.  this is the link that they press to open MyTime
   This is the text that appears in the link of the email when you are transferring a not at home territory to another witness.  this is the link that they press to open MyTime */
"Click on this link from your iPhone/iTouch" = "Klikkaa tätä linkkiä iPhone/iTouch laitteessasi";

/* Book Publication Name (cf) */
"Come Be My Follower" = "Tule minun seuraajakseni";

/* Tracts Publication Name (T-20) */
"Comfort for the Depressed" = "Lohdutusta masentuneille";

/* Book Publication Name (cj) */
"Commentary on James" = "Jaakobin kirjeen selitys";

/* More->Settings view Compress backup link */
"Compress Backup" = "Pakkaa varmistus";

/* Book Publication Name (cn) */
"Concordance" = "Concordance";

/* backup connected message */
"Connected to the Backup Application.\n\nUse it to create a backup or to restore a backup" = "Yhdistetty varmistussovellukseen.\n\nKäytä sitä varmistuksen luomiseen tai palauttamiseen";

/* More View Table Group Title */
"Contact Information" = "Yhteystiedot";

/* Title for switch in the filter for the strings operator */
"Contains" = "Sisältää";

/* Campaign Tract Publication Name (?) */
"Convention Invitation" = "Konventtikutsu";

/* button to convert a not at home territpry house into a regular call */
"Convert to call" = "Muuta käynniksi";

/* When making a new additional information if you previsouly had a 'String' type and you want to change it to a multiple choice, this is the text used, because I go through all of the values of the 'String' and automatically set those up as choices */
"Convert to Multiple Choice" = "Muuta monivalinnaksi";

/* this message is presented to the user when they are upgrading their MyTime and MyTime is converting their old database file to a new one */
"Converting Data File" = "Muutetaan tiedostoa";

/* initial message when trying to transfer backup files */
"Could not create %@ directory" = "Hakemistoa %@ ei voitu luoda";

/* More->Settings->Delete map cache: error message if the map cache could not be deleted */
"Could not delete map cache" = "Karttatietoja ei voitu poistaa";

/* More->Settings->Remove Custom Translation: error message if the custom translation file could not be removed */
"Could not remove custom translation" = "Käännöstä ei voitu poistaa";

/* More View Table Enable shown popups */
"Create a note from scratch" = "Tee uusi muistiinpano";

/* Settings label for the current user */
"Current User" = "Nykyinen käyttäjä";

/* Title for field in the Additional Information for the user to create their own additional information field */
"Custom" = "Oma";

/* Book Publication Name (dp) */
"Daniel's Prophecy" = "Danielin profetia";

/* This is the text that appears in the link of the email when you are wanting to restore from a backup.  this is the link that they press to open MyTime */
"Data file link" = "Tiedoston linkki";

/* cell title in the Date Picker View where you can change the return visit date
   Title for the Display Rules 'pick a sort rule' screen */
"Date" = "Päivämäärä";

/* button bar title */
"Date Sorted" = "Päivittäin";

/* Call Metadata
   cell title in the Date Picker View where you can change the return visit date */
"Date/Time" = "Päivämäärä/Aika";

/* Day singular */
"Day" = "Päivä";

/* section title for calls older than this time interval */
"Day Old" = "Päivää vanhemmat";

/* Days plural */
"Days" = "Päivää";

/* section title for calls older than this time interval */
"Days Old" = "Päivää vanhemmat";

/* Short month name */
"Dec" = "Jou";

/* Long month name */
"December" = "Joulukuu";

/* Multiple Users: the default user name when the user has not entered a name for themselves */
"Default User" = "Oletuskäyttäjä";

/* Transferr this call to another MyTime user and delete it off of this iphone, but keep the data */
"Delete All Data" = "Poista kaikki tiedot";

/* Delete Call button in editing mode of call view */
"Delete Call" = "Poista käynti";

/* Button used to delete \"Additional Information\" from all calls with the message: This Additional Information was added to some of your calls. Do you want to remove it from your calls? */
"Delete From All Calls" = "Poista kaikista käynneistä";

/* Title for the Display Rules 'pick a sort rule' screen */
"Deleted" = "Poistettu";

/* Deleted calls view button title */
"Deleted Calls" = "Poista käynnit";

/* view title */
"Deleted Calls Sorted by Street" = "Poistetut käynnit kaduittain lajiteltuna";

/* Title for switch in the filter view to have the strings be compared in a diacritic sensitive manor */
"Diacritic Insensitive" = "Diakriittisesti riippumaton";

/* Title of the view you are presented from Settings->Passcode when you are disabling the passcode */
"Disable Passcode" = "Poista pääsykoodi";

/* backup connected message */
"Disconnected from the Backup Application" = "Yhteys varmistussovellukseen katkaistu";

/* Title of button on the Sorted By... view if the user put in a display rule that does not have a name */
"Display Rule" = "Näkymäsääntö";

/* This is the placeholder text in the Display Rule detail screen where you name the display rule */
"Display Rule Name" = "Näytä säännön nimi";

/* In the Settings view this is the row that lets you configure all of the sorting/filter rules */
"Display Rules" = "Näkymät";

/* Brochures Publication Name (na) */
"Divine Name" = "Jumalan nimi joka pysyy ikuisesti";

/* Label for picking the location lookup type when they do not want the return visit to show up in the map */
"Do not show in map" = "Älä näytä kartalla";

/* Tracts Publication Name (T-25) */
"Do You Have an Immortal Spirit" = "Onko ihmisellä kuolematon henki?";

/* More View Table Link to Documentation */
"Documentation" = "Dokumentaatio";

/* Tracts Publication Name (T-71) */
"Does Fate Rule Our Lives" = "Ohjaako kohtalo elämäämme?";

/* Brochures Publication Name (dg) */
"Does God Care" = "Välittääkö Jumala todella meistä";

/* Brochures Publication Name (je) */
"Doing God's Will" = "Jumalan tahdon tekeminen";

/* Book Publication Name (cl) */
"Draw Close to Jehovah" = "Lähesty Jehovaa";

/* Publication Type name */
"DVD" = "DVD";

/* Publication Type name */
"DVD (not counted)" = "DVD (ei lasketa)";

/* Publication Type name */
"DVD Brochure" = "DVD Kirjanen";

/* Plural Publication Type name */
"DVD Brochures" = "DVD Kirjaset";

/* DVD Publication Name (9224) */
"DVD Drama: Bore Witness" = "DVD Näytelmä: Bore Witness";

/* DVD Publication Name  (9215) */
"DVD Drama: Noah/David" = "DVD Näytelmä: Nooa/Daavid";

/* DVD Publication Name (9215) */
"DVD Drama: Pursue Goals" = "DVD Näytelmä: Pursue Goals";

/* DVD Publication Name  */
"DVD Drama: Respect Authority" = "DVD Drama: Respect Authority";

/* DVD Publication Name (9241) */
"DVD Drama: Submit to Authority" = "DVD Drama: Submit to Authority";

/* DVD Publication Name (9241) */
"DVD Drama: Troublesome Times/Boldly Witnessing" = "DVD Drama: Troublesome Times/Boldly Witnessing";

/* DVD Publication Name (dvmy) */
"DVD: Bible Stories" = "DVD: Kirjani Raamatun kertomuksista";

/* DVD Publication Name (9232) */
"DVD: Bible Teach" = "DVD: Raamattu opettaa";

/* DVD Publication Name (9220) */
"DVD: Family Happiness" = "DVD: Perheonnen salaisuus";

/* DVD Publication Name (9211) */
"DVD: God's Friend" = "DVD: Jumalan ystävä";

/* DVD Publication Name () */
"DVD: Great Teacher" = "DVD: Suuri opettaja";

/* DVD Publication Name (9202) */
"DVD: Greatest Man" = "DVD: Suurin ihminen";

/* DVD Publication Name (dvfa1-DVE) */
"DVD: Jehovah's Witnesses - Faith in Action, Part 1: Out of Darkness" = "DVD: Jehovan todistajat - Usko toiminnassa, Osa 1: Ulos pimeydestä";

/* DVD Publication Name (dvutp-DVE) */
"DVD: Jehovah's Witnesses - Faithful Under Trials and Purple Triangles" = "DVD: Jehovan todistajat - Uskollisia koetuksissa ja Violetit kolmiot";

/* DVD Publication Name (dvfi-DVE) */
"DVD: Jehovah's Witnesses Stand Firm Against Nazi Assault" = "DVD: Jehovan todistajat pysyvät lujina Natsien vainoissa";

/* DVD Publication Name (9218) */
"DVD: Keep on the Watch" = "DVD: Pysykää valveilla";

/* DVD Publication Name (?) */
"DVD: Keep Yourselves in Gods Love " = "DVD: Pitäkää itsenne Jumalan rakkaudessa ";

/* DVD Publication Name (dvkl) */
"DVD: Knowledge" = "DVD: Tieto joka johtaa ikuiseen elämään";

/* DVD Publication Name (dvjwa-DVE) */
"DVD: Organized to Share Good News and Whole Association of Brothers" = "DVD: Järjestetyt suorittamaan palvelusta ja Koko veljesseura";

/* DVD Publication Name (9201) */
"DVD: Require" = "DVD: Require";

/* DVD Publication Name (9203) */
"DVD: Sing Praises Vol 1&2" = "DVD: Laulakaa ylistystä Jehovalle 1 ja 2";

/* DVD Publication Name (9229) */
"DVD: Sing Praises Vol 3" = "DVD: Laulakaa ylistystä Jehovalle 3";

/* DVD Publication Name (9216) */
"DVD: Spirits of the dead" = "DVD: Kuolleiden henget";

/* DVD Publication Name (dvbbl-DVE) */
"DVD: The Bible - A Book of Fact and Prophecy" = "DVD: Raamattu - Tosiasioiden ja ennustusten kirja";

/* DVD Publication Name (dvedt-DVE) */
"DVD: The the Ends of the Earth and United by Divine Teaching" = "DVD: Maan ääriin asti ja Jumalallisen opetuksen yhdistämät";

/* DVD Publication Name (dvwc-DVE) */
"DVD: The Wonders of Creation Reveal God's Glory" = "DVD: Luomakunnan ihmeet julistavat Jumalan kunniaa";

/* DVD Publication Name (dvalt-DVE) */
"DVD: Transfusion Alternatives - Documentary Series" = "DVD: Verensiirron vaihtoehdot - Dokumenttisarja";

/* DVD Publication Name (dvwra-DVE) */
"DVD: Warning Examples for Our Day and Respect Jehovah's Authority" = "DVD: Varottavia esimerkkejä meidän päivillemme ja Kunnoita Jehovan valtaa";

/* DVD Publication Name (9221) */
"DVD: When someone you love dies" = "DVD: Kun joku rakkaasi kuolee";

/* DVD Publication Name (9213) */
"DVD: Worship God" = "DVD: Palvo Jumalaa";

/* DVD Publication Name (?) */
"DVD: Would You Like To Know the Truth?" = "DVD: Haluaisitko tietää totuuden?";

/* DVD Publication Name (dvfe-DVE) */
"DVD: Young People Ask - How Can I Make Real Friends?" = "DVD: Nuoret kysyvät - Kuinka voin saada tosiystäviä?";

/* DVD Publication Name (dvyf-DVE) */
"DVD: Young People Ask - What Will I Do With My Life?" = "DVD: Nuoret kysyvät - Miten käytän elämäni?";

/* Plural Publication Type name */
"DVDs" = "DVD:t";

/* Plural Publication Type name */
"DVDs (not counted)" = "DVD:t (ei lasketa)";

/* Sort Rules View title */
"Edit Display Rule" = "Muokkaa näkymäsääntöä";

/* Sort Rules View title */
"Edit Rules" = "Muokkaa näkymiä";

/* Sort Rules View title */
"Edit Sort Rule" = "Muokkaa lajittelusääntöä";

/* Brochures Publication Name (ed) */
"Education" = "Koulutus";

/* localized date string string using http://unicode.org/reports/tr35/tr35-4.html#Date_Format_Patterns as a guide to how to format the date */
"EEE, M/d/yyy" = "EEE, M/d/yyy";

/* localized date string string using http://unicode.org/reports/tr35/tr35-4.html#Date_Format_Patterns as a guide to how to format the date */
"EEE, M/d/yyy h:mma" = "eeee, d/M/yyy h:mma";

/* Call Metadata */
"Email" = "Sähköposti";

/* pick an email address */
"Email Address" = "Sähköpostiosoite";

/* Autobackup disabled label in the statistics view, setting title */
"Email autobackup disabled" = "Sähköpostivarmistus pois käytöstä";

/* More View Table backup your data by emailing the data */
"Email backup" = "Sähköpostivarmistus";

/* Email the call details to another MyTime user
   Email the not at home territory details to another MyTime user */
"Email Details" = "Sähköpostin tiedot";

/* button that the user clicks when they want to email a mytime backups */
"Email MyTime Backup" = "Lähetä MyTime varmuuskopio";

/* button that the user clicks when they want to email a printable backup */
"Email Printable Backup" = "Lähetä tulostettava varmuuskopio";

/* question to ask the user if they want a mytime backup or printable backup */
"Email printable backup or MyTime backup? (The printable backup can not be used to automatically restore MyTime data)" = "Lähetetäänkö tulostettava varmistus vai MyTime varmistus? (Tulostettavaa varmistusta ei voi käyttää automaattiseen MyTime tiedostojen palautukseen)";

/* Months to email Information title */
"Email Report" = "Lähetä raportit";

/* Title for switch in the filter for the strings operator */
"Empty" = "Tyhjä";

/* Google Localized Language Name */
"en" = "fi";

/* More View Table Enable shown popups */
"Enable shown popups" = "Salli ponnahdusikkunat";

/* Title for switch in the filter for the strings operator */
"Ends With" = "Päättyy";

/* Tracts Publication Name (T-21) */
"Enjoy Family Life" = "Tee perhe-elämäsi nautittavaksi";

/* First Prompt to enter a passcode to limit access to MyTime */
"Enter a passcode" = "Syötä pääsykoodi";

/* This is the title for the Statistics->Edit->Select an hours row-> view that pops up to allow you to edit the hours */
"Enter Hours" = "Syötä tunnit";

/* Footer sentance in the More->Settings->Secretary's Email view, letting the user know that they can enter in multiple email addresses */
"Enter multiple email addresses by seperating each address by a space" = "Voit antaa useamman sähköpostiosoitteen erottamalla ne välilyönnillä";

/* Custom Information Placeholder before the user enters in what they want to call this field, like 'Son's name' or whatever */
"Enter Name Here" = "Kirjoita nimi tähän";

/* Prompt to enter a passcode to gain access to MyTime */
"Enter Passcode" = "Syötä pääsykoodi";

/* multiple choice value placeholder text */
"Enter the multiple choice value" = "Syötä monivalinta-arvo";

/* text that appears in the Call->Edit->Add Additional Information->Edit->Add Custom->Multiple Choice type area so that you can add values to your multiple choice type */
"Enter the multiple choice values here" = "Syötä monivalinta-arvot tähän";

/* Prompt to enter a passcode turn off the passcode in MyTime */
"Enter your passcode to disable" = "Syötä pääsykoodi poistaaksesi sen käytöstä";

/* Title for switch in the filter for the number operator
   Title for switch in the filter for the strings operator */
"Equals" = "Vastaa";

/* More->Settings view title for erasing the map cache */
"Erase map cache" = "Poista karttatiedot";

/* This is a message you see when you make a new Call -> press on the address -> press on automatically lookup address, and there is a geolocation error (the google lookup of the address failed) */
"Error acquiring location, reverse lookup failed" = "Virhe paikannuksessa, haku epäonnistui";

/* This is a dialog message title whenever there is an error saving data; you should not see this normally */
"Error Saving Data" = "Virhe tietojen tallennuksessa";

/* This is a message you see when you make a new Call -> press on the address -> press on automatically lookup address, and the location services can not obtain a location (could happen for iPod or iPhone with only wifi turned on and location cant be determined by wifi) */
"Error: Location Services can not find your location." = "Virhe: Paikannuspalvelu ei löytänyt sijaintiasi.";

/* Book Publication Name (ce) */
"Evolution or Creation" = "Elämä maan päällä - kehityksen vai luomisen tulos";

/* Book Publication Name (es) */
"Examining the Scriptures Daily" = "Tutkimme Raamattua päivittäin";

/* backup failed string */
"Failed advertising server" = "Varmistupalvelinta ei löydy";

/* failure message for starting the backup service */
"Failed creating server" = "Varmistupalvelimen luonti epäonnsitui";

/* Book Publication Name (fy) */
"Family Happiness" = "Perheonnen salaisuus";

/* Book Publication Name (fl) */
"Family Life" = "Tee perhe-elämäsi onnelliseski";

/* this is a section label in the 'quick notes' view if you edit a call and add brand new notes.  The favorites section is where you can add your own favorite notes */
"Favorites" = "Suosikit";

/* Short month name */
"Feb" = "Hel";

/* Long month name */
"February" = "Helmikuu";

/* Subject text for the email that is sent for the Field Service Activity report */
"Field Service Activity Report" = "Kenttäpalvelusraportti";

/* Settings Section Name */
"Field Service Report" = "Kenttäpalvelusraportti";

/* Section title for the Display Rule editing view */
"Filter Rules" = "Suodatus";

/* Button in More->settings that points the user to the bug tracking system */
"Found a bug?" = "Löysitkö virheen?";

/* Book Publication Name (po) */
"God's Eternal Purpose" = "Jumalan ”ikuinen tarkoitus” nyt saamassa voiton ihmisen hyödyksi";

/* Brochures Publication Name (gf) */
"God's Friend" = "Voit olla Jumalan ystävä!";

/* Book Publication Name (ka) */
"God's Kingdom Has Approached" = "Jumalan tuhatvuotinen valtakunta on tullut lähelle";

/* Book Publication Name (gm) */
"God's Word" = "Raamattu – Jumalan vai ihmisen sana?";

/* Brochures Publication Name (gl) */
"Good Land" = "Hyvä maa";

/* Brochures Publication Name  */
"Good News for People of All Nations" = "Hyvä uutinen kaikille kansakunnille";

/* Book Publication Name (gh) */
"Good News to Make You Happy" = "Hyvä uutinen joka voi tehdä sinut onnelliseksi";

/* Brochures Publication Name (bp) */
"Government" = "Hallitus joka tuo paratiisin";

/* Title for switch in the filter for the number operator */
"Greater Than" = "Suurempi kuin";

/* Title for switch in the filter for the number operator */
"Greater Than or Equals" = "Suurempi tai vastaava kuin";

/* Book Publication Name (gt) */
"Greatest Man Who Ever Lived" = "Suurin ihminen joka koskaan on elänyt";

/* Brochures Publication Name (gu) */
"Guidance of God" = "Jumalan johdatus – tie paratiisiin";

/* Book Publication Name (hp) */
"Happiness-How to Find It" = "Onnellisuus – miten löydät sen";

/* Tracts Publication Name (T-74) */
"Hellfire-Is It Part of Divine Justice?" = "Helvetin tuli – onko se Jumalan määräämä rangaistus?";

/* button title the user sees when they have an error converting data */
"HELP! Fix My Data!" = "APUA! Korjatkaa tietoni!";

/* Book Publication Name (hs) */
"Holy Spirit" = "Pyhä henki";

/* label used in the Statistics->Edit->press hours picker view
   Singular form of the word hour */
"hour" = "tunti";

/* 'Hours' ButtonBar View text, Label for the amount of hours spend in the ministry, and Expanded name when on the More view */
"Hours" = "Tunnit";

/* label used in the Statistics->Edit->press hours picker view
   Plural form of the word hours */
"hours" = "tuntia";

/* House Number
   Title for the Display Rules 'pick a sort rule' screen
   used as a label when emailing not at homes */
"House Number" = "Talon numero";

/* Title of the section in the Not-At-Homes street view that allows you to add/edit houses in the street
   used as a label when emailing not at homes */
"Houses" = "Talot";

/* Tracts Publication Name (rp) */
"How to Find the Road to Paradise" = "Miten löytää tie paratiisiin?";

/* button to not send the email backup.  I want to have this to have the sense of sounding very bad, like: I dont care about my data, dont backup */
"I don't want to backup" = "En halua tehdä varmistusta";

/* button that the user clicks when they have let their Yes mean Yes that they have read the website */
"I have read the webpage" = "Olen lukenut web-sivuston";

/* This is the text that appears in the link of the email when you are wanting to restore from a backup.  this is the link that they press to open MyTime */
"If you want to restore from your backup, click on this link from your iPhone/iTouch" = "Jos haluat palauttaa varmuuskopion, klikkaa tätä linkkiä iPhone/iTouch laitteessasi";

/* button title the user sees when they have an error converting data */
"Ignore Fatal Error" = "Ohita virhe";

/* This message is displayed after a successful import of a call or a restore of a backup */
"Import successful" = "Tuonti onnistui";

/* Title in the 'Additional Information' for the entries that will always show in every call */
"Information Always Shown" = "Aina näytettävät tiedot";

/* This is used to signify the first visit which is not counted as a return visit.  This is in the view where you get to pick the visit type */
"Initial Visit" = "Ensikäynti";

/* Initial Visit Notes default text when the user did not enter notes, displayed on the view-mode Call view */
"Initial Visit Notes" = "Ensikäynnin muistiinpanot";

/* Book Publication Name (it) */
"Insight" = "Raamatun ymmärtämisen opas";

/* Title for switch in the filter view to change the logical result of the filter to the logical alternate value TRUE->FALSE or FALSE->TRUE */
"Invert Logic" = "Muuntologiikka";

/* Book Publication Name (ct) */
"Is there a Creator Who Cares About You?" = "Onko Luojaa joka välittää sinusta?";

/* Book Publication Name (ts) */
"Is This Life All There Is?" = "Nykyinen elämämme – siinäkö kaikki?";

/* Book Publication Name (ip-1) */
"Isaiah's Prophecy I" = "Jesajan profetia I";

/* Book Publication Name (ip-2) */
"Isaiah's Prophecy II" = "Jesajan profetia II";

/* This is the message the user is presented with when they have not backed up their mytime data ever, or they are past their autobackup interval */
"It has been a while since you did an email backup, want to do it now? It just takes 2 seconds." = "Et ole lähettänyt varmistusta vähään aikaan. Haluatko tehdä sen nyt? Se kestää noin 2 sekuntia.";

/* Short month name */
"Jan" = "Tam";

/* Long month name */
"January" = "Tammikuu";

/* Brochures Publication Name (jt) */
"Jehovah's Witnesses" = "Jehovan todistajat";

/* Tracts Publication Name (T-18) */
"Jehovah's Witnesses-What Do They Believe?" = "Jehovan todistajat - mihin he uskovat?";

/* Tracts Publication Name (T-23) */
"Jehovah-Who Is He?" = "Jehova - Kuka Hän on?";

/* Tracts Publication Name (T-24) */
"Jesus Christ-Who Is He?" = "Jeesus Kristus - Kuka hän on?";

/* Short month name */
"Jul" = "Hei";

/* Long month name */
"July" = "Heinäkuu";

/* Short month name */
"Jun" = "Kes";

/* Long month name */
"June" = "Kesäkuu";

/* Brochures Publication Name (kp) */
"Keep on the Watch!" = "Pysykää valveilla!!";

/* Book Publication Name (lv) */
"Keep Yourselves in Gods Love" = "Pitäkää itsenne Jumalan rakkaudessa";

/* Tracts Publication Name (T-26) */
"Know the Bible" = "Tietää Raamatusta";

/* Book Publication Name (kl) */
"Knowledge That Leads to Everlasting Life" = "Tieto joka johtaa ikuiseen elämään";

/* Last Service year total hours label */
"Last Service Year Total" = "Viime palvelusvuosi yhteensä";

/* Brochures Publication Name (pc) */
"Lasting Peace" = "Lasting Peace";

/* Button used in the Alert View that is presented for:This Additional Information was added to all of your calls, do you want to remove it from all of your calls, or just remove the unused values from your calls? */
"Leave All" = "Jätä kaikkiin";

/* Title for switch in the filter for the number operator */
"Less Than" = "Pienempi kuin";

/* Title for switch in the filter for the number operator */
"Less Than or Equals" = "Pienempi tai vastaava kuin";

/* Book Publication Name (kc) */
"Let Your Kingdom Come" = "Tulkoon sinun valtakuntasi";

/* Book Publication Name (lp) */
"Life Does Have A Purpose" = "Elämällä on tarkoitus";

/* Tracts Publication Name (T-15) */
"Life in a Peaceful New World" = "Elämä rauhaisassa uudessa maailmassa";

/* Brochures Publication Name (le) */
"Life on Earth" = "Nauti elämästä maan päällä ikuisesti!";

/* Book Publication Name (te) */
"Listen to the Great Teacher" = "Suuren Opettajan kuunteleminen";

/* Book Publication Name (pe) */
"Live Forever in Paridise on Earth" = "Sinä voit elää ikuisesti paratiisissa maan päällä";

/* Book Publication Name (jd) */
"Live With Jehovah's Day in Mind" = "Elä Jehovan päivä mielessäsi";

/* Label for picking the location lookup type */
"Locate using google Maps" = "Paikanna Google Maps:illa";

/* Select Location informatio type Type title */
"Location" = "Sijainti";

/* Title for the Display Rules 'pick a sort rule' screen */
"Location Aquired" = "Haettu sijainti";

/* Title for the Display Rules 'pick a sort rule' screen */
"Location Lookup Type" = "Sijainnin etsintätapa";

/* title for the marker when you have to manually set the location for a call */
"Location Unavaliable, please move me" = "Sijaintia ei käytettävissä, siirrä minut";

/* Brochures Publication Name (mn) */
"Look!" = "Katso!";

/* This is a message you see when you make a new Call -> press on the address -> press on automatically lookup address, and geolocation is having a hard time getting accurate results */
"Looking up position, current accuracy is %dm" = "Etsitään sijaintia, nykyinen tarkkuus on %dm";

/* This is the first message you see when you make a new Call -> press on the address -> press on automatically lookup address */
"Looking up your position with Location Services" = "Etsitään sijaintiasi paikannuspalvelun avulla";

/* localized date string string using http://unicode.org/reports/tr35/tr35-4.html#Date_Format_Patterns as a guide to how to format the date */
"M/d/yyy" = "d/M/yyy";

/* localized date string string using http://unicode.org/reports/tr35/tr35-4.html#Date_Format_Patterns as a guide to how to format the date */
"M/d/yyy h:mma" = "d/M/yyy h:mma";

/* Publication Type name */
"Magazine" = "Lehti";

/* Plural Publication Type name
   Publication Type name */
"Magazines" = "Lehdet";

/* these are the instructions for connecting to the MyTime web server from the Settings View */
"Make sure you are on the same network as your iPhone/iPod then open a web browser and type in \"http://%@\" as the location." = "Varmista että olet samassa verkossa iPhone/iPod laitteesi kanssa. Avaa internet selain ja kirjoita osoiteriville \"http://%@\".";

/* Book Publication Name (sl) */
"Man's Salvation" = "Ihmisen pelastus maailman ahdingosta käsillä!";

/* Book Publication Name (sh) */
"Mankind's Search for God" = "Ihmiskunta etsii Jumalaa";

/* Label for picking the location lookup type */
"Manually pick Location" = "Valitse sijainti manuaalisesti";

/* Confirmation message about the map data being deleted */
"Map cache has been deleted" = "Karttatiedostot on poistettu";

/* Mapped calls view title */
"Mapped Calls" = "Käynnit kartalla";

/* Short month name */
"Mar" = "Maa";

/* Long month name */
"March" = "Maaliskuu";

/* label name for the cell asking if you want to match all or just match one */
"Match" = "Vastaavuus";

/* Short/Long month name */
"May" = "Tou";

/* Campaign Tract Publication Name (mi yearly tract) */
"Memorial Tract" = "Muistonviettokutsu";

/* Book Publication Name (sg) */
"Ministry School" = "Teokraattisen palveluskoulun ohjekirja";

/* label used in the Statistics->Edit->press hours picker view
   Singular form of the word minute */
"minute" = "minuutti";

/* label used in the Statistics->Edit->press hours picker view
   Plural form of the word minutes */
"minutes" = "minuuttia";

/* Call Metadata */
"Mobile Phone" = "Matkapuhelin";

/* Month singular */
"Month" = "Kuukausi";

/* Title for selecting the number of months shown in the statistics view */
"Month Count" = "Kuukausia";

/* Months plural */
"Months" = "Kuukautta";

/* section title for calls older than this time interval */
"Months Old" = "Kuukautta vanhemmat";

/* MyTime Website buton in the Tutorials view */
"More info..." = "Lisätietoja...";

/* Title for the Display Rules 'pick a sort rule' screen */
"Most Recent Return Visit Date" = "Viimeisimmän uusintakäynnin päivämäärä";

/* title for the marker when you have to manually set the location for a call */
"Move me" = "Siirrä minut";

/* Yes roll over the extra minutes to the next month where %d is the placeholder for the number of minutes */
"Move to next month" = "Siirrä seuraavalle kuukaudelle";

/* Call Metadata
   title that appears in the Call->Edit->Add Additional Information->Edit->Add Custom->Multiple Choice type section */
"Multiple Choice" = "Monivalinta";

/* Settings section header for the current user */
"Multiple User Settings" = "Asetukset useammalle käyttäjälle";

/* Book Publication Name (my) */
"My Book of Bible Stories" = "Kirjani Raamatun kertomuksista";

/* Email subject line for the email that has your backup data in it */
"MyTime Application Data Backup" = "MyTime ohjelman varmuuskopio";

/* Email subject line for the email that has a printable version of the mytime data */
"MyTime Application Printable Backup" = "MyTime ohjelman tulostettava varmuuskopio";

/* Subject text for the email that is sent for sending the details of a call to another witness */
"MyTime Call, open this on your iPhone/iTouch" = "MyTime käynti, avaa tämä iPhone/iTouch laitteessasi";

/* Email subject line for the email that will be sent to me when there is a failure in the data conversion in the 4.0 version of mytime */
"MyTime Data Convert Failure" = "MyTime tietojen muunnosvirhe";

/* Title of the section when editing the display rules, this title defines the 'X Sorted' tabs' sort/display rules */
"MyTime Display Rules" = "MyTime näkymät";

/* Email body for the email that will be sent to me when there is a failure in the data conversion in the 4.0 version of mytime */
"MyTime encountered an error translating your data to the new format.<br><br><b>Your old data is still safe</b>, I have included it in this email for the author of MyTime to fix.  The author of MyTime will try to respond quickly to your problem with a fixed data file for you to use.  <br><br>You <i>might</i> be able to use MyTime as is and see no loss of data; MyTime just detected a difference in your data between the old data file and the new one.  To be safe, dont depend on this.<br><br>" = "MyTime kohtasi virheen muunnettaessa tietojasi uuteen formaattiin.<br><br><b>Aikasemmat tietosi ovat edelleen tallessa</b> ja ne on liitetty tähän sähköpostiin korjausta varten.  MyTime ohjelman tekijä yrittää vastata ongelmaasi mahdollisimman nopeasti ja toimittaa sinulle toimivat tiedot.  <br><br><i>Saatat</i> pystyä käyttämään MyTime ohjelmaa nykyisellään ilman tietojen häviämistä; MyTime huomasi vain eroja edellisten ja nykyisten tietojen välillä.  Tietojen säilymien ei kuitenkaan ole varmaa tässä tilanteessa.<br><br>";

/* Email subject line for the email that will be sent to me when mytime finds an error/crash just before crashing */
"MyTime encountered an error which would normally cause a crash.<br><br>Please send this email to the author of MyTime so that your problem can be fixed and if there is any dammage to your data it can be repaired.  The author of MyTime will try to respond quickly to your problem.  <br><br>You <i>might</i> be able to use MyTime as is and see no loss of data; MyTime just detected an error<br><br>" = "MyTime ohjelmassa ilmeni virhe, joka normaalisti johtaisi ohjelman kaatumiseen.<br><br>Lähetä tämä sähköpostiviesti ohjelman tekijälle, jotta ongelma voidaan korjata ja mahdolliset vahingoittuneet tiedot korjata.  MyTime ohjelman tekijä yrittää korjata virheen mahdollisimman pian.  <br><br>Voit <i>ehkä</i> pystyä käyttämään MyTimea sellaisenaan ilman tietojen häviämistä; MyTime vain huomasi jonkin virheen<br><br>";

/* Subject text for the email that is sent for sending the details of a call to another witness */
"MyTime Not At Home Territory, open this on your iPhone/iTouch" = "MyTime Ei tavattavissa alue, avaa tämä iPhone/iTouch laitteessasi";

/* This message is displayed when someone clicks on a file to open mytime in an email or a webpage which will open up mytime to either add a transfered call or restore from a backup */
"MyTime opened with invalid file" = "MyTime ohjelma avattiin virheellisellä tiedostolla";

/* This message is displayed when someone clicks on a link in an email or a webpage which will open up mytime to either add a transfered call or restore from a backup */
"MyTime opened with invalid URL" = "MyTime avattiin virheellisellä URL osoitteella";

/* Email subject line for the email that will be sent to me when mytime finds an error/crash just before crashing */
"MyTime Runtime Error" = "MyTime Runtime Error";

/* More View Table MyTime Version */
"MyTime Version" = "MyTime Versio";

/* More View Table MyTime Website */
"MyTime Website" = "MyTime Internetsivusto";

/* Name label for Call in editing mode
   Title for the Display Rules 'pick a sort rule' screen */
"Name" = "Nimi";

/* button bar title */
"Name Sorted" = "Nimen mukaan";

/* Book Publication Name (kj) */
"Nations Shall Know I am Jehovah" = "Kansat tulevat tietämään, että minä olen Jehova – miten";

/* Call main title when you are adding a new call */
"New Call" = "Uusi käynti";

/* Title for the Sorted By ... area when you are editing the display rules */
"New Display Rule" = "Uusi näkymäsääntö";

/* Title for the Sorted By ... area when you are editing the display rules and adding a filter rule */
"New Filter Rule" = "Uusi lajittelusääntö";

/* Title for the Sorted By ... area when you are editing the display rules */
"New Sort Rule" = "Uusi lajittelusääntö";

/* NO for boolean switch in additional information */
"NO" = "EI";

/* No button title
   No dont delete the call
   No dont restore the call */
"No" = "Älä";

/* Text that appears at the sorted call views when there are no entries configured */
"No Calls" = "Ei käyntejä";

/* Text that appears at the Hours view when there are no entries configured */
"No Hours" = "Ei tunteja";

/* Text that appears at the Bulk placements view when there are no entries configured */
"No Placements" = "Ei julkaisuja";

/* Text that appears at the Not-At-Homes view when there are no entries configured */
"No Territories" = "Ei alueita";

/* return visit type name */
"Not At Home" = "Ei tavattavissa";

/* Bulk placements notes view title
   Call Metadata
   Not At Homes notes view title
   Title for the Display Rules 'pick a sort rule' screen */
"Notes" = "Muistiinpanot";

/* More->Settings view publisher type setting title */
"Notes for Secretary" = "Huomautuksia sihteerille";

/* this is a section label in the 'quick notes' view if you edit a call and add brand new notes.  The history section is where you can add notes to a call based on a previous note you wrote */
"Notes History" = "Muistiinpanohistoria";

/* Short month name */
"Nov" = "Mar";

/* Long month name */
"November" = "Marraskuu";

/* Call Metadata */
"Number" = "Numero";

/* Number Placed label for the Number Picker for the number of publications placed */
"Number Placed:" = "Julkaisuja levitetty:";

/* Short month name */
"Oct" = "Lok";

/* Long month name */
"October" = "Lokakuu";

/* Off or disabled (used in the More->Settings->Passcode Lock Setting */
"Off" = "Pois";

/* section title for calls older than this time interval */
"OFF" = "POIS";

/* Dismiss an Alert View
   OK button */
"OK" = "OK";

/* Section Title for Date Sorted Calls 'Oldest Return Visits First' */
"Oldest Return Visits First" = "Vanhimmat uusintäkäynnit ensin";

/* section title for calls older than this time interval */
"ON" = "PÄÄLLÄ";

/* On or enabled (used in the More->Settings->Passcode Lock Setting */
"On" = "Päällä";

/* label name for the cell asking if you want to match all or just match one */
"One" = "Yksi";

/* Book Publication Name (od) */
"Organized To Do Jehovah's Will" = "Järjestetyt tekemään Jehovan tahto";

/* Title in the 'Additional Information' for the entries that can be added per call */
"Other Information" = "Muita tietoja";

/* Book Publication Name (go) */
"Our Incoming World Government" = "Tuleva maailmanhallituksemme – Jumalan valtakunta";

/* Brochures Publication Name (op) */
"Our Problems" = "Our Problems";

/* Book Publication Name (pm) */
"Paradise Restored To Mandkind" = "Paratiisi ennallistetaan ihmiskunnalle – teokratian toimesta!";

/* More->Settings view name for the Passcode Setting */
"Passcode Lock" = "Pääsykoodi lukitus";

/* text that appears if the passcodes dont match, this should match what is in the iphone's Settings->General->Passcode when you messup the passcode confirm */
"Passcodes did not match. Try again." = "Pääsykoodit eivät täsmänneet. Yritä uudelleen.";

/* Call Metadata */
"Phone" = "Puhelin";

/* Statistics button to allow you to pick months to send to the congregation secretary */
"Pick Months To Send" = "Valitse kuukaudet";

/* publisher type selected in the More->Settings->Publisher Type setting */
"Pioneer" = "Tienraivaaja";

/* Label for More->Settings pioneer start date used to start calculating the statistics */
"Pioneer Start Date" = "Tienraivauksen aloituspäivämäärä";

/* View Title and ButtonBar Title for the Day's Bulk Placed Publications */
"Placements" = "Julkaisut";

/* Placements Group title for the Day's Bulk Literature Placements */
"Placements:" = "Julkaisut:";

/* More View Table Donation request */
"Please Donate, help me help you" = "Tee lahjoitus, autat ohjelman ylläpitämisessä";

/* Multiple Users: This message is displayed when fails to enter a username when there is more than one user in the system */
"Please enter a name since you have more than one user of MyTime" = "Anna nimesi. MyTime ohjelmaan on määritelty useampi kuin yksi käyttäjä";

/* More->Settings->Send field service report using... message to the publisher to be considerate of the secretary who might not accept SMS messages */
"Please make sure your congregation secretary is willing to accept SMS messages" = "Varmista, että seurakuntasi sihteeri haluaa vastaanottaa tekstiviestejä";

/* This is the warning message that shows up in the More->Settings->Multiple Users when you are editing the user */
"Please note that if you delete a user ALL of your data will be DELETED for that user, this includes calls, return visits, hours, EVERYTHING!" = "Huomaa, että jos poistat käyttäjän, KAIKKI käyttäjän tiedot POISTETAAN, mukaanlukien käynnit, uusintakäynnit, tunnit - KAIKKI!";

/* This message is displayed after you turn off the MyTime Webserver from the Settings View */
"Please quit MyTime if you changed any data using the MyTime Webserver" = "Sulje MyTime jos teit muutoksia tietoihin MyTime Webserverillä";

/* More->Settings->Remove Custom Translation: confirmaiton message when you have applied the 'Remove Custom Translation' */
"Please quit MyTime to apply change" = "Sulje MyTime muutoksien käyttöönottamiseksi";

/* warning to the user that they should remember their passcode */
"Please remember your passcode. You will not be able to recover this passcode if you forget it." = "Laita pääsykoodisi hyvään talteen. Jos unohdat sen, sitä ei voi palauttaa.";

/* This is text in the header of the screen when you try to select one of the multiple choice values */
"Please select one option" = "Valitse yksi vaihtoehto";

/* Information for the user to know what is going on with this and new releases */
"Please visit mytime.googlecode.com to see the FAQ and feature requests.\nA lot of work has been put into MyTime, if you find this application useful then you are welcome to donate.  Is English not your native language and you want to help to translate? Email me (look in the More view and Settings)" = "Käy osoitteessa mytime.googlecode.com tarkastellaksesi FAQ (usein kysyttyjä kysymyksiä) ja kehitysideoita.\nMyTime:n tekemiseksi on nähty paljon vaivaa. Jos havaitset ohjelman hyödylliseksi, voit tukea työtä pienellä lahjoituksella.  Jos Englanti ei ole äidinkielesi, voit auttaa ohjelman kääntämisessä omalle kielellesi. Lähetä sähköpostia minulle(katso Lisää -> Asetukset)";

/* initial setup message beore we have advertized the backup service (this message needs to be a bit long because the alertView can not resize when first shown) */
"Please wait for the Backup Service to initalize...\n\nGo to mytime.googlecode.com for more information about the Backup Application" = "Odota Varmistuspalvelimen alustusta...\n\nMene osoitteeseen mytime.googlecode.com saadaksesi lisätietoja Varmistussovelluksesta";

/* this message is presented to the user when they are upgrading their MyTime and MyTime is converting their old database file to a new one */
"Please wait. Just a few more seconds..." = "Odota vielä muutama sekunti...";

/* this message is presented to the user when they are upgrading their MyTime and MyTime is converting their old database file to a new one */
"Please wait. This might take a minute or two." = "Odota, tämä saattaa kestää minuutin tai pari.";

/* Confirmation message about enabling popup messages */
"Popup messages like this are now enabled to be shown once all throughout MyTime" = "Ponnahdusikkunat, kuten tämä, on nyt sallittu MyTime ohjelman sisällä";

/* Book Publication Name (jv) */
"Proclaimers" = "Jehovan todistajat – Jumalan valtakunnan julistajia";

/* singular 'Publication' label for Number Picker; this is the label that is beside the number in the picker */
"Publication" = "Julkaisu";

/* 'Publications' label for Number Picker; this is the label that is beside the number in the picker */
"Publications" = "Julkaisut";

/* publisher type selected in the More->Settings->Publisher Type setting */
"Publisher" = "Julistaja";

/* More->Settings view publisher type setting title */
"Publisher Type" = "Julistajatyyppi";

/* Brochures Publication Name (pr) */
"Purpose of Life" = "Elämän tarkoitus";

/* initial message when trying to transfer backup files */
"Pushed %@ translation file, restart MyTime to see the changes." = "%@ käännöstiedosto ladattu, käynnistä MyTime uudelleen ottaaksesi muutokset käyttöön.";

/* More View Table Questions, Comments? Email me */
"Questions, Comments? Email me" = "Kysymyksiä, kommentteja? Lähetä sähköpostia";

/* Quick Notes title.  This is shown when you click on the notes to type in for a call, it is the title of the view that shows you the last several notes you have typed in */
"Quick Notes" = "Vakiomuistiinpanot";

/* 'RBC Hours' ButtonBar View text, Label for the amount of hours spent doing quick builds */
"RBC" = "Pikasalityö";

/* 'RBC Hours' ButtonBar View text, Label for the amount of hours spent doing quick builds */
"RBC Hours" = "Pikasalityötunnit";

/* First Prompt to enter a passcode to limit access to MyTime */
"Re-enter your passcode" = "Syötä pääsykoodi uudelleen";

/* Book Publication Name (rs) */
"Reasoning" = "Puhu perustellen käyttämällä Raamattua";

/* Title for switch in the filter for the strings operator */
"Regular Expression Match" = "Lausevastaavuus";

/* Button used in the Alert View that is presented for:This Additional Information was added to all of your calls, do you want to remove it from all of your calls, or just remove the unused values from your calls? */
"Remove All" = "Poista kaikki";

/* More->Settings custom translation title */
"Remove Custom Translation" = "Poista käännöstiedosto";

/* Button used in the Alert View that is presented for:This Additional Information was added to all of your calls, do you want to remove it from all of your calls, or just remove the unused values from your calls? */
"Remove Unused" = "Poista käyttämättömät";

/* Brochures Publication Name (rq) */
"Require" = "Mitä Jumala vaatii meiltä?";

/* Restore Call button in editing mode of call view */
"Restore Call" = "Palauta käynti";

/* Yes restore from the backup please */
"Restore from Backup" = "Palauta varmuuskopiosta";

/* Button to click to add an additional sort or filter rule for the Sorted By ... view */
"Restore to Defaults" = "Palauta oletusasetukset";

/* category in the Display Rules when picking sorting rules
   return visit type name */
"Return Visit" = "Uusintakäynti";

/* Title for the Display Rules 'pick a sort rule' screen */
"Return Visit Information" = "Uusintakäynnin tiedot";

/* Return Visit Notes default text when the user did not enter notes, displayed on the view-mode Call view */
"Return Visit Notes" = "Uusintakäyntien muistiinpanot";

/* Return Visits label on the Statistics View */
"Return Visits" = "Uusintakäynnit";

/* Book Publication Name (re) */
"Revelation Climax" = "Ilmestyksen suurenmoinen huipentuma on käsillä!";

/* Brochures Publication Name (ol) */
"Road to Life" = "Road to Life";

/* Yes round up where %d is a placeholder for the number of hours */
"Round Up to %d hours" = "Pyöristä %d tuntiin";

/* Brochures Publication Name (la) */
"Satisfying Life" = "Tyydytystä tuottava elämä – miten voit saavuttaa sen";

/* Brochures Publication Name (sj) */
"School" = "Koulu ja Jehovan todistajat";

/* Section Title when the user is searching */
"Search Results" = "Hakutulokset";

/* email address for the congregation secretary
   More->Settings view publisher type setting title */
"Secretary's Email" = "Sihteerin sähköposti";

/* More->Settings title
   phone number for the congregation secretary */
"Secretary's Telephone" = "Sihteerin puhelinnumero";

/* Title of the screen where you pick the publication type: Magazine, Book, tract... */
"Select %@" = "Valitse %@";

/* Title for the view where you Pick A Date */
"Select Date" = "Valitse päivämäärä";

/* Title for the view where you manually select the location for the call */
"Select Location" = "Valitse sijainti";

/* 'Select Publication' Publication Picker title */
"Select Publication" = "Valitse julkaisu";

/* Sort Rules View title */
"Select Rule" = "Valitse sääntö";

/* Select Time Title for adding hours of field service to a particular day */
"Select Time" = "Valitse aika";

/* Publication Type title */
"Select Type" = "Valitse tyyppi";

/* Multiple Users View title */
"Select User" = "Valitse käyttäjä";

/* In the \"Sorted By...\" view this is the prompt that appears to tell the user to pick what to sort by */
"Select What To Sort By" = "Valitse lajittelutapa";

/* Send button like the send button in the email program, to send your field service activity report to the congregation secretary */
"Send" = "Lähetä";

/* This is text used in the statistics view where you click on the 'ActionSheet' button and it asks you what you want to do to send your congregation secretary your statistics where %@ is the placeholder for the month */
"Send %@ Report" = "Lähetä %@:n raportti";

/* button to send the email backup */
"Send email backup" = "Lähetä varmuuskopio";

/* Choice to send the Field Service Report using email */
"Send report using email" = "Lähetä raportti sähköpostilla";

/* Choice to send the Field Service Report using SMS */
"Send report using SMS" = "Lähetä raportti tekstiviestinä";

/* initial message when trying to transfer backup files */
"Sending Settings to the Backup Application" = "Lähetetään asetukset varmistussovellukseen";

/* Short month name */
"Sep" = "Syy";

/* Long month name */
"September" = "Syyskuu";

/* Service year total hours label */
"Service Year Total" = "Palvelusvuoden yhteismäärät";

/* Title of the view you are presented from Settings->Passcode when you are enabling the passcode */
"Set Passcode" = "Aseta pääsykoodi";

/* 'Settings' ButtonBar View text and Statistics View Title */
"Settings" = "Asetukset";

/* button that the user clicks when they have not read the FAQ or feature request list */
"Show me the webpage" = "Näytä web-sivusto";

/* Book Publication Name (Ssb) */
"Sing Praises" = "Laulakaa ylistystä Jehovalle";

/* Title for row in the 'Edit Sort Rule' view for the ascending switch */
"Sort Ascending" = "Lajittele nousevasti";

/* Section title for the Display Rule editing view */
"Sort Rules" = "Lajittelu";

/* View title */
"Sorted By ..." = "Lajittelu ...";

/* publisher type selected in the More->Settings->Publisher Type setting */
"Special Pioneer" = "Erikoistienraivaaja";

/* Brochures Publication Name (sp) */
"Spirits of the Dead" = "Kuolleiden henget";

/* Settings View button to start the webserver that allows you to type in your calls, import/export data, add translations, and import hours */
"Start MyTime Webserver" = "Käynnistä MyTime WebServer";

/* 'Start Time' navigation bar action button */
"Start Time" = "Aloitus";

/* Set this to 1 if your country abbreviates the state in all capital letters, otherwise set this to 0 */
"State in all caps" = "0";

/* State or Country
   Title for the Display Rules 'pick a sort rule' screen
   used as a label when emailing not at homes */
"State or Country" = "Osavaltio tai maa";

/* 'Statistics' ButtonBar View text and Statistics View Title */
"Statistics" = "Tilastot";

/* Title for email section for the data that the user changed in the statistics view */
"Statistics Adjustments" = "Tilaston mukautus";

/* 'Stop Time' navigation bar action button */
"Stop Time" = "Lopetus";

/* Street
   Title for the Display Rules 'pick a sort rule' screen
   used as a label when emailing not at homes */
"Street" = "Katu";

/* This is the territory idetifier that is on the Territories->New/edit territory */
"Street Name" = "Kadun nimi";

/* Street Sorted button title */
"Street Sorted" = "Kaduittain";

/* Title of the section in the Not-At-Homes territory view that allows you to add/edit streets in the territory
   used as a label when emailing not at homes */
"Streets" = "Kadut";

/* Call Metadata */
"String" = "String";

/* title of the Statistics->Study Individuals-> list of studies
   View title */
"Studies" = "Tutkistelut";

/* return visit type name */
"Study" = "Tutkistelu";

/* Bible Studies label on the Statistics View */
"Study Individuals" = "Yksittäiset tutkistelut";

/* Magizine Publication Name (w) */
"Study Watchtower" = "Vartitorni - tutkittava";

/* Book Publication Name (su) */
"Survival Into a New Earth" = "Elossa säilyminen uuteen maahan";

/* Text that appears at the sorted call views when there are no entries configured */
"Tap + to add a call" = "Paina + lisätäksesi käynnin";

/* Text that appears at the Not-At-Homes view when there are no entries configured */
"Tap + to add a not-at-home territory" = "Paina + lisätäksesi  alueen";

/* Text that appears at the Hours view when there are no entries configured */
"Tap + to add hours" = "Paina + lisätäksesi tunteja";

/* Text that appears at the bulk placements view when there are no entries configured */
"Tap + to add street witnessing placements" = "Paina + lisätäksesi katutyössä levitettyjä julkaisuja";

/* View title for the previously named 'Not At Homes' but it is representing the user's territory now */
"Territories" = "Alueet";

/* This is the territory idetifier that is on the Territories->New/edit territory
   used as a label when emailing not at homes */
"Territory Name/Number" = "Alueen nimi/numero";

/* this is the label in the Territories View when you press on the Add button and enter in the territory's information */
"Territory Owner's Email Address" = "Alueen omistajan sähköpostiosoite";

/* Brochures Publication Name (bm) */
"The Bible, What is its Message" = "Raamattu – mikä on sen sanoma?";

/* Description of what to do with the sort rules in the Display Rule editor */
"The first sort rule determines what is used in the index to the right of the list of calls.  The '∧' and '∨' at the end of the rows specifies an ascending or decending sort." = "Ensimmäisenä oleva lajittelu määrittää, mitä käytetään luettelointiin käyntien oikeassa reunassa.  '∧' ja '∨' rivien lopussa ilmaisee, onko lajittelu nousevassa vai laskevassa järjestyksessä.";

/* Tracts Publication Name (T-72) */
"The Greatest Name" = "Suurin nimi";

/* Brochures Publication Name (lf) */
"The Origin of Life" = "Elämän alkuperä – viisi tärkeää kysymystä";

/* Multiple Users: This message is displayed when the user is renaming their name and it matches another user's name */
"There is already a user with this name" = "Käyttäjänimi on jo olemassa";

/* This is a dialog message title whenever there is an error saving data; you should not see this normally */
"There was an error trying to save data, this is very bad... Please try again or quit the application." = "Tiedon tallennuksessa tapahtui virhe. Yritä uudelleen tai lopeta ohjelma.";

/* this is the description in the Display Rules view when you are editing the display rules */
"These display rules are used in MyTime for all of the street, city, date, name, study, etc. sorted views" = "Näitä näkymiä käytetään MyTime:ssä katu, kaupunki, päivämäärä, nimi, tutkistelu, ym. lajitteluun";

/* If the user has added this \"Additional Information\" to the \"Always Shown\" section then MyTime adds this additional information to all of the calls, so when the user wants to remove this particular \"Additional Information\" from the always shown section they have a choice to remove all of the additional information from their calls or just the additional information that has not already been filled out in their calls */
"This Additional Information was added to all of your calls, do you want to remove it from all of your calls, or just remove the unused values from your calls?" = "Tämä lisätieto on liitetty kaikkiin käynteihisi. Haluatko poistaa sen kaikista käynneistäsi vai haluatko vain poistaa käyttämättömät arvot käynneistäsi?";

/* This message is presented when the user deletes an \"Additional Information\" that was added to at least one call and actually used */
"This Additional Information was added to some of your calls. Do you want to remove it from your calls?" = "Tämä lisätieto on liitetty joihinkin käynteihisi. Haluatko poistaan sen käynneistäsi?";

/* This is the first part of the body of the email message that is sent to a user when you click on a Not At Home Territory and then click on the action button in the upper left corner and select transfer or email details */
"This not at home territory has been turned over to you, here are the details.  If you are a MyTime user, please view this email on your iPhone/iTouch and scroll all the way down to the end of the email and click on the link to import this not at home territory into MyTime.<br><br>" = "Tämä ei tavattavissa -alue on siirretty sinulle, tässä yksityiskohdat.  Jos olet MyTime käyttäjä, lue tämä sähköposti iPhone/iTouch laitteessasi, siirry viestin loppuun ja klikkaa linkkiä siirtääksesi tämän ei tavattavissa -alueen MyTime:n.<br><br>";

/* This is the first part of the body of the email message that is sent to a user when you click on a Call then click on Edit and then click on the action button in the upper left corner and select transfer or email details */
"This return visit has been turned over to you, here are the details.  If you are a MyTime user, please view this email on your iPhone/iTouch and scroll all the way down to the end of the email and click on the link to import this call into MyTime.<br><br>Return Visit Details:<br>" = "Tämä uusintakäynti on siirretty sinulle, tässä yksityiskohdat.  Jos olet MyTime käyttäjä, lue tämä sähköposti iPhone/iTouch laitteessasi, siirry viestin loppuun ja klikkaa linkkiä siirtääksesi tämän ei tavattavissa -alueen MyTime:n.<br><br>Uusintakäynnin tiedot:<br>";

/* This is a note displayed when they first see the Statistics View */
"This will show you your tabulated end of the month field service activity including:\nHours\nBooks\nBrochures\nMagazines\nStudies\n Please note that you will only see items that you have counts for." = "Tästä näet eritellyn kenttäpalvelusraporttisi kuukauden päättyessä, sisältäen:\nTunnit\nKirjat\nKirjaset\nLehdet\nTutkistelut\n Huomaa, että tässä näytetään vain sellaiset kohteet, joista on merkintöjä.";

/* Time for %@ Group title on the Statistics View where %@ is the month of the year */
"Time for %@" = "Raportti %@";

/* Hours view prompt when you press the start time button */
"Time started at: %@" = "Aloitusaika: %@";

/* Title for switch in the filter for the number operator */
"Today" = "Tänään";

/* This is a note displayed when they first see the non editable call view */
"Touch the Edit button to add a return visit or you can see where your call is located by touching the address of your call" = "Kosketa Muokkaa -painiketta lisätäksesi uusintakäynnin. Voit myös nähdä käynnin sijainnin koskettamalla osoitetta käyntimerkinnässä";

/* Publication Type name */
"Tract" = "Traktaatti ";

/* Plural Publication Type name */
"Tracts" = "Traktaatit";

/* Transferr this call to another MyTime user and delete it off of this iphone, but keep the data
   Transferr this not at home territory to another MyTime user and delete it off of this iphone, but keep the data */
"Transfer, and Delete" = "Siirrä ja poista";

/* return visit type name when this call is transfered from another witness */
"Transfered Initial Visit" = "Ensikäynti siirrettiin";

/* return visit type name when this call is transfered from another witness */
"Transfered Not At Home" = "Ei tavattavissa siirrettiin";

/* return visit type name when this call is transfered from another witness */
"Transfered Return Visit" = "Uusintakäynti siirrettiin";

/* return visit type name when this call is transfered from another witness */
"Transfered Study" = "Tutkistelu siirrettiin";

/* publisher type selected in the More->Settings->Publisher Type setting */
"Traveling Servant" = "Matkavalvoja";

/* Brochures Publication Name (ti) */
"Trinity" = "Kolminaisuus";

/* Book Publication Name (tp) */
"True Peace and Security" = "Tosi rauha ja turvallisuus";

/* Book Publication Name (tr) */
"Truth That Leads to Eternal Life" = "Totuus joka johtaa ikuiseen elämään";

/* 'Tutorials' ButtonBar View text, Label for the title of the view that has all of the youtube howto videos
   Button to take the user directly to the tutorials view from the first popup in mytime */
"Tutorials" = "Opastus";

/* Publication Type name */
"TwoMagazine" = "Lehtipari";

/* Return visit type label
   Title for the Display Rules 'pick a sort rule' screen
   type of Additional Information, used as a title to the section Call->Edit->Add Additional Information->Edit->Add Custom */
"Type" = "Tyyppi";

/* Book Publication Name (uw) */
"United in Worship" = "Yhdistetyt ainoan tosi Jumalan palvonnassa";

/* Sorted by ... view section header for unknown values
   Sorted by Street Calls view section title for an unknown street */
"Unknown" = "Tuntematon";

/* Call Metadata */
"URL" = "URL";

/* This is the help that appears in the Filter Detail view when you choose something like Name to filter on and then you choose the wildcard match */
"Use * to match any number of characters and use ? to match any one character." = "Käytä merkkiä * vastaamaan mitä tahansa määrää merkkejä ja merkkiä ? vastaamaan yhtä vastaavaa merkkiä.";

/* Text that appears at the sorted call views when there are no entries configured */
"Use another call view to add a call" = "Lisää käyntejä näkymien kautta";

/* Description of what to do with the filter rules in the Display Rule editor */
"Use the filters to specify what is shown.  The match one or all selection can be used to logically build any filtering rule." = "Käytä lajittelua näkymien määrittelyyn. Yhden tai useamman vastaavuuden määrittelyä voidaan käyttää minkä tahansa lajittelusäännön muodostamiseen.";

/* Title for the Display rules section when editing the display rules */
"User Defined Display Rules" = "Käyttäjän määrittämät näkymät";

/* Label for filter view for the date value to match with
   This is the placeholder text in the Display Rule detail screen where you name the display rule */
"Value" = "Arvo";

/* This is a very important message that is at the end of the email used to transfer a call to another witness or if you are just emailing a backup to yourself, it verifies that all of the data is contained in the email, if it is not there then all of the data is not in the email and something bad happened :(
   This is a very important message that is at the end of the email used to transfer a not at home territory to another witness or if you are just emailing a backup to yourself, it verifies that all of the data is contained in the email, if it is not there then all of the data is not in the email and something bad happened :( */
"VERIFICATION CHECK: all data was contained in this email" = "TARKISTUS: kaikki tiedot sisältyivät tähän viestiin";

/* this message is presented to the user when they are upgrading their MyTime and MyTime is converting their old database file to a new one */
"Verifying Data File" = "Tarkistetaan tiedostoa";

/* More View Table Group Title */
"Version" = "Versio";

/* section title for calls older than this time interval */
"Very Old" = "Erittäin vanhat";

/* Title for the view where you write notes for a call */
"Visit Notes" = "Muistiinpanot";

/* Return Visit Type title */
"Visit Type" = "Käynnin tyyppi";

/* Both Magizines (w and g) */
"W & A" = "VT ja H";

/* initial message when trying to transfer backup files */
"Waiting for the Backup Application to connect...\n\nGo to mytime.googlecode.com for more information about the Backup Application" = "Odotetaan varmistussovelluksen yhdistämistä...\n\nSiirry sivustolle mytime.googlecode.com saadaksesi lisätietoja varmistussovelluksesta";

/* Brochures Publication Name (lc) */
"Was Life Created?" = "Onko elämä luotu?";

/* Magizine Publication Name (w) */
"Watchtower" = "Vartiotorni";

/* Book Publication Name (wvol) */
"Watchtower Bound Volume" = "Vartiotornin sidottu vuosikerta";

/* section title for calls older than this time interval */
"Weeks Old" = "Viikkoa vanhat";

/* Tracts Publication Name (T-14) */
"What Do Jehovah's Witnesses Believe?" = "Mitä Jehovan todistaja uskovat?";

/* Book Publication Name (bh) */
"What Does the Bible Really Teach?" = "Mitä Raamattu todella opettaa?";

/* Tracts Publication Name (T-16) */
"What Hope for Dead Loved Ones?" = "Mitä toivoa on kuolleilla omaisillamme?";

/* Brochures Publication Name (we) */
"When Someone Dies" = "Kun joku rakkaasi kuolee";

/* This is the section title for transferred calls in the view that allows you to select a visit type for your call */
"When Transfered To You:" = "Kun siirretty sinulle:";

/* Brochures Publication Name (ie) */
"When We Die" = "Mitä meille tapahtuu kun kuolemme?";

/* Tracts Publication Name (T-73) */
"Who Are Jehovah's Witnesses?" = "Keitä Jehovan todistajat ovat?";

/* Tracts Publication Name (T-22) */
"Who Really Rules the World?" = "Kuka todellisuudessa hallitsee tätä maailmaa?";

/* Brochures Publication Name (wj) */
"Why Worship God" = "Why Worship God";

/* Tracts Publication Name (T-13) */
"Why You Can Trust the Bible" = "Miksi voit luottaa Raamattuun";

/* Title for switch in the filter for the strings operator */
"Wildcard Match" = "Jokeri";

/* Tracts Publication Name (T-19) */
"Will This World Survive?" = "Tuleeko tämä maailma säilymään?";

/* Brochures Publication Name (wi) */
"World Without War" = "Tuleeko koskaan sodatonta maailmaa?";

/* Book Publication Name (ws) */
"Worldwide Security" = "Maailmanlaajuinen turvallisuus ”Rauhanruhtinaan” alaisuudessa";

/* Book Publication Name (wt) */
"Worship the Only True God" = "Palvo ainoaa tosi Jumalaa";

/* Campaign Tract Publication Name (kt) */
"Would You Like To Know the Truth?" = "Haluaisitko tietää totuuden?";

/* If the publisher has 1 hour 14 minutes, this question shows up in the statistics view if they click on the hours for a month, this question is asking them if they want to round up or roll over the minutes */
"Would you like to move %d minutes from the month of %@ to the next month? Or, round up to %d hours for %@?\n(This will change the time that you put in the Hours view so you can undo this manually)" = "Haluatko siirtää %1$d minuuttia kuukaudelta %2$@ seuraavalle kuukaudelle? Vai pyöristetäänkö %3$d tuntiin %4$@:lle?\n(Tämä muuttaa ajan, jonka laitat Tunnit näkymään joten voit kumota tämän toiminnon manuaalisesti)";

/* This is a success message you see when you make a new Call -> press on the address -> press on automatically lookup address */
"Would you like to use this address?" = "Haluatko käyttää tätä osoitetta?";

/* Book Publication Name (yb) */
"Yearbook" = "Vuosikirja";

/* section title for calls older than this time interval */
"Years Old" = "Vuotta vanha";

/* YES for boolean switch in additional information */
"YES" = "KYLLÄ";

/* Yes button title
   Yes delete the call
   Yes restore the call */
"Yes" = "Kyllä";

/* YES button to change the type of additional information from the dialog: You have changed the type of the Additional Information, this will reset any values you are currently using in any of your calls.  Are you sure you want to do this? */
"Yes change and reset data" = "Kyllä, muuta ja palauta tiedot";

/* Transferr this call from another user */
"Yes, add call" = "Kyllä, lisää käynti";

/* Transferr this call from another user */
"Yes, add territory" = "Kyllä. lisää alue";

/* Call Metadata */
"YES/NO Switch" = "KYLLÄ/EI kytkin";

/* Title for switch in the filter for the number operator */
"Yesterday" = "Eilen";

/* This is the second part of the body of the email message that is sent to a user when you click on a Call then click on Edit and then click on the action button in the upper left corner and select transfer or email details */
"You are able to import this call into MyTime if you click on the link below while viewing this email from your iPhone/iTouch.  Please make sure that at the end of this email there is a \"VERIFICATION CHECK:\" right after the link, it verifies that all data is contained within this email<br>" = "Voit tuoda tämän käynnin MyTime ohjelmaan klikkaamalla alla olevaa linkkiä sähköpostiviestissä (iPhone/iPad laitteella luettaessa).  Varmista, että viestin lopussa on  \"TARKISTUS:\" heti linkin perässä. Se varmistaa, että kaikki tiedot ovat tämän viestin liitteenä<br>";

/* This is the second part of the body of the email message that is sent to a user when you click on a Not At Home Territory and then click on the action button in the upper left corner and select transfer or email details */
"You are able to import this not at home territory into MyTime if you click on the link below while viewing this email from your iPhone/iTouch.  Please make sure that at the end of this email there is a \"VERIFICATION CHECK:\" right after the link, it verifies that all data is contained within this email<br>" = "Voit tuoda tämän Ei tavattavissa merkinnän MyTime ohjelmaan klikkaamalla alla olevaa linkkiä sähköpostiviestissä (iPhone/iPad laitteella luettaessa).  Varmista, että viestin lopussa on  \"TARKISTUS:\" heti linkin perässä. Se varmistaa, että kaikki tiedot ovat tämän viestin liitteenä<br>";

/* This is the body of the email that is sent when you go to More->Settings->Email Backup */
"You are able to restore all of your MyTime data as of the sent date of this email if you click on the link below while viewing this email from your iPhone/iTouch. Please make sure that at the end of this email there is a \"VERIFICATION CHECK:\" right after the link, it verifies that all data is contained within this email<br><br>WARNING: CLICKING ON THE LINK BELOW WILL DELETE YOUR CURRENT DATA AND RESTORE FROM THE BACKUP<br><br>" = "Voit palauttaa kaikki MyTime tiedot klikkaamalla alla olevaa linkkiä sähköpostiviestissä (iPhone/iPad laitteella luettaessa).  Varmista, että viestin lopussa on  \"TARKISTUS:\" heti linkin perässä. Se varmistaa, että kaikki tiedot ovat tämän viestin liitteenä<br><br>VAROITUS: KLIKKAAMALLA ALLA OLEVAA LINKKIÄ KAIKKI NYKYISET TIEDOT POISTETAAN JA KORVATAAN VARMUUSKOPION TIEDOIlla<br><br>";

/* This message gets displayed when the user is trying to add a call from an email when the call was transferred from another iphone/itouch */
"You are trying to import a call into MyTime, are you sure you want to do this?" = "Olet tuomassa käyntiä MyTime:en, haluatko varmasti tuoda tiedot?";

/* This message gets displayed when the user is trying to add a not at home territory from an email when the call was transferred from another iphone/itouch */
"You are trying to import a not at home territory into MyTime, are you sure you want to do this?" = "Olet tuomassa Ei tavattavissa merkintää MyTime:en, haluatko varmasti tuoda tiedot?";

/* This message gets displayed when the user is trying to restore from a backup from the email program */
"You are trying to restore all MyTime data from a backup, are you sure you want to do this?  THIS WILL DELETE ALL OF YOUR CURRENT DATA" = "Olet palauttamassa kaikkia MyTime tietoja varmuuskopiosta, haluatko varmasti palauttaa tiedot?  TÄMÄ TOIMINTO POISTAA KAIKKI NYKYISET TIEDOT";

/* This message is displayed when the user clicks on a Call then clicks on Edit and clicks on the \"Action\" button at the top left of the screen */
"You can transfer this call to someone else. Transferring will delete this call from your data, but your statistics from this call will stay. The witness who gets this email will be able to click on a link in the email and add the call to MyTime." = "Voit siirtää tämän käynnin jollekin toiselle. Siirtäminen poistaa tämän käynnin tiedoistasi, mutta käynti näkyy edelleen raportissasi. Julistaja, joka vastaanottaa tämän viestin, voi viestissä olevaa linkkiä klikkaamalla lisätä sen omaan MyTime ohjelmaansa.";

/* This message is displayed when the user clicks on a territory and clicks on the \"Action\" button at the top left of the screen */
"You can transfer this not at home territory to someone else. Transferring will delete this territory from your data or just emailing the details will keep the data. The witness who gets this email will be able to click on a link in the email and add the territory to MyTime." = "Voit siirtää tämän Ei tavattavissa merkinnän jollekin toiselle. Siirtäminen poistaa tämän käynnin tiedoistasi, mutta pelkkä lähetys sähköpostiviestinä säilyttää tiedot. Julistaja, joka vastaanottaa tämän viestin, voi viestissä olevaa linkkiä klikkaamalla lisätä sen omaan MyTime ohjelmaansa.";

/* This message is presented when the user has changed an \"Additional Information\" type from one type to an incompatible type like a \"String\" to a \"Date\" */
"You have changed the type of an Additional Information which is currently being used, this will reset any values you are currently using in any of your calls. \nAre you sure you want to do this?" = "Olet vaihtanut Lisätietojen tyyppiä tiedosta, joka on parhaillaan käytössä. Tämä palauttaa käynneillesi määrittelemät arvot oletusasetuksiinnsa. Haluatko jatkaa?";

/* This is the message you see when MyTime converts your data from the old format to the new one and has detected a failure */
"You have encountered a serious error when converting your old data file to the new format. The developer of MyTime can help you, press on the \"HELP!\" button below and email your datafile, he should be able to get back with you with a fixed data file." = "Vanhojen tiedostojen muunnossa uuteen tiedostomuotoon on tapahtunut vakava virhe. MyTime ohjelman kehittäjä voi auttaa ongelmassa. Paina \"APUA!\" painiketta ja lähetä sähköpostilla tiedostosi. Saat korjatun tiedoston paluupostissa.";

/* This is a message displayed when the user does not have email setup on their iDevice */
"You must setup email on this device to be able to send an email.  Open the Mail application and setup your email account" = "Sähköposti pitää olla asennettuna laitteessasi, jotta voisit lähettää sähköpostia.  Avaa Mail sovellus ja asenna sähköpostitilisi tiedot";

/* these are the instructions for connecting to the MyTime web server from the Settings View */
"You need to be on a WiFi Network for the MyTime Webserver to work" = "Laitteesi pitää olla kytkettynä langattomaan verkkoon (WiFi), jotta MyTime palvelin voisi toimia";

/* Book Publication Name (ype-1) */
"Young People Ask 1" = "Nuoret kysyvät 1";

/* Book Publication Name (ype-2) */
"Young People Ask 2" = "Nuoret kysyvät 2";

/* Tracts Publication Name (yi) */
"Your Life" = "Elämäsi";

/* The title used in the Settings->Multiple Users screen */
"Your Name" = "Nimesi";

/* Book Publication Name (yy) */
"Your Youth" = "Nuoruutesi";

